# Preliminary Data Exploration and Data Cleaning with Pandas

In [1]:
import pandas as pd

In [16]:
df = pd.read_csv("salaries_by_college_major.csv")

# to see the first 5 rows
df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 6 columns]

In [17]:
# to see the last 5 rows
df.tail()

      Undergraduate Major  ...  Group
46             Psychology  ...   HASS
47               Religion  ...   HASS
48              Sociology  ...   HASS
49                Spanish  ...   HASS
50  Source: PayScale Inc.  ...    NaN

[5 rows x 6 columns]

## To see the number of rows and columns of data frame

In [8]:
df.shape

(51, 6)

## To view the name of columns of data frame

In [9]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

## To find NAN(Not a Number) which can be string or empty cells

In [15]:
df.isna()

    Undergraduate Major  ...  Group
0                 False  ...  False
1                 False  ...  False
2                 False  ...  False
3                 False  ...  False
4                 False  ...  False
5                 False  ...  False
6                 False  ...  False
7                 False  ...  False
8                 False  ...  False
9                 False  ...  False
10                False  ...  False
11                False  ...  False
12                False  ...  False
13                False  ...  False
14                False  ...  False
15                False  ...  False
16                False  ...  False
17                False  ...  False
18                False  ...  False
19                False  ...  False
20                False  ...  False
21                False  ...  False
22                False  ...  False
23                False  ...  False
24                False  ...  False
25                False  ...  False
26                False  ...  False
27                False  ...  False
28                False  ...  False
29                False  ...  False
30                False  ...  False
31                False  ...  False
32                False  ...  False
33                False  ...  False
34                False  ...  False
35                False  ...  False
36                False  ...  False
37                False  ...  False
38                False  ...  False
39                False  ...  False
40                False  ...  False
41                False  ...  False
42                False  ...  False
43                False  ...  False
44                False  ...  False
45                False  ...  False
46                False  ...  False
47                False  ...  False
48                False  ...  False
49                False  ...  False
50                False  ...   True

[51 rows x 6 columns]

## Deleting last column which contain NAN value and save the data frame in a new variable.

In [18]:
clean_df = df.dropna()
clean_df.tail()

   Undergraduate Major  ...  Group
45   Political Science  ...   HASS
46          Psychology  ...   HASS
47            Religion  ...   HASS
48           Sociology  ...   HASS
49             Spanish  ...   HASS

[5 rows x 6 columns]

# Accessing Columns and Individual Cells in a Dataframe
### Find College Major with Highest Starting Salaries

In [21]:
# To find the highest starting salary we can simply chain the .max() method.
clean_df['Starting Median Salary'].max()

74300.0

In [23]:
# .idxmax() method will give us index for the row with the largest value.
max_start_sal_id = clean_df['Starting Median Salary'].idxmax()
max_start_sal_id

43

In [26]:
# .loc[] takes index labels and returns rows or dataframe if the index label exists in the caller data frame.
clean_df["Undergraduate Major"].loc[max_start_sal_id]

'Physician Assistant'

In [27]:
# we can get the whole data frame of that index by using
clean_df.loc[max_start_sal_id]

Undergraduate Major                  Physician Assistant
Starting Median Salary                             74300
Mid-Career Median Salary                           91700
Mid-Career 10th Percentile Salary                  66400
Mid-Career 90th Percentile Salary                 124000
Group                                               STEM
Name: 43, dtype: object

## Challenge

### 1. What college major has the highest mid-career salary? How much do graduates with this major earn?

In [29]:
# What college major has the highest mid-career salary?
max_mid_sal_id = clean_df["Mid-Career Median Salary"].idxmax()
clean_df["Undergraduate Major"].loc[max_mid_sal_id]

'Chemical Engineering'

In [30]:
# How much do graduates with this major earn?
clean_df["Mid-Career Median Salary"].max()

107000.0

### 2. Which college major has the lowest starting salary and how much do graduates earn after university?

In [31]:
# Which college major has the lowest starting salary?
min_start_sal_id = clean_df['Starting Median Salary'].idxmin()
clean_df["Undergraduate Major"].loc[min_start_sal_id]

'Spanish'

In [32]:
# how much do graduates earn after university?
clean_df['Starting Median Salary'].min()

34000.0

### 3. Which college major has the lowest mid-career salary and how much can people expect to earn with this degree?

In [33]:
# Which college major has the lowest mid-career salary?
min_mid_sal_id = clean_df["Mid-Career Median Salary"].idxmin()
clean_df["Undergraduate Major"].loc[min_mid_sal_id]

'Education'

In [35]:
# how much can people expect to earn with this degree?
clean_df.loc[min_mid_sal_id]

Undergraduate Major                  Education
Starting Median Salary                   34900
Mid-Career Median Salary                 52000
Mid-Career 10th Percentile Salary        29300
Mid-Career 90th Percentile Salary       102000
Group                                     HASS
Name: 18, dtype: object

# Sorting Values & Adding Columns: Majors with the Most Potential vs Lowest Risk

## Lowest Risk Majors

In [42]:
""" To find The difference we can use :
clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']

or :
clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary']) """

spread_col = clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])
clean_df.insert(3,"Spread",spread_col)
clean_df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 7 columns]

### Sorting by the Lowest Spread

In [43]:
# .sort_values() is used to sort the column
low_risk = clean_df.sort_values("Spread")
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

## Challenge

###  can you find the degrees with the highest potential?

In [46]:
highest_potential = clean_df.sort_values("Mid-Career 90th Percentile Salary",ascending=False)
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

### find the degrees with the greatest spread in salaries.

In [45]:
high_spread = clean_df.sort_values("Spread",ascending=False)
high_spread[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

# Grouping and Pivoting Data with Pandas

###  to sum rows that below to a particular category. For example, which category of degrees has the highest average salary? Is it STEM, Business or HASS

In [47]:
# To answer this question we need to learn to use the .groupby() method.
clean_df.groupby('Group').count()

          Undergraduate Major  ...  Mid-Career 90th Percentile Salary
Group                          ...
Business                   12  ...                                 12
HASS                       22  ...                                 22
STEM                       16  ...                                 16

[3 rows x 6 columns]

## Mini Challenge
### .mean() method to find the average salary by group?

In [51]:
pd.options.display.float_format = "{:,.2f}".format # used to formact the number to 2 desimal place.
clean_df.groupby("Group").mean()

          Starting Median Salary  ...  Mid-Career 90th Percentile Salary
Group                             ...
Business               44,633.33  ...                         147,525.00
HASS                   37,186.36  ...                         129,363.64
STEM                   53,862.50  ...                         157,625.00

[3 rows x 5 columns]

# Today's Learning Points

In [ ]:
# Use .head(), .tail(), .shape and .columns to explore your DataFrame and find out the number of rows and columns as well as the column names.

# Look for NaN (not a number) values with .findna() and consider using .dropna() to clean up your DataFrame.

# You can access entire columns of a DataFrame using the square bracket notation: df['column name'] or df[['column name 1', 'column name 2', 'column name 3']]

# You can access individual cells in a DataFrame by chaining square brackets df['column name'][index] or using df['column name'].loc[index]

# The largest and smallest values, as well as their positions, can be found with methods like .max(), .min(), .idxmax() and .idxmin()

# You can sort the DataFrame with .sort_values() and add new columns with .insert()

# To create an Excel Style Pivot Table by grouping entries that belong to a particular category use the .groupby() method